{
  // You can set global properties in this appsettings.json file, which will:

  // 1. Allow you to access these properties in your test code. For example, if you wanted the code to return you the project name,
  // you can specify the project name here, and then add the following in your code to access 
  // this property value: AppSettings.Config["ProjectName"]
  "ProjectName": "Wikipedia",

  // 2. Change default properties that are originally set within SeleniumCoreSettings.cs inside our Browser Base Framework project
  "HubUri": "http://10.91.4.57:8888/wd/hub", // This property is required and must be added/set within this file within your project
  "HubName": "c3dilmssg01", // This property is required and must be added/set within this file within your project
  //"HubUri": "http://10.91.16.29:8888/wd/hub",
  //"HubName": "c3dierpdevsel01",
  //"DefaultDownloadDirectory": "C:\\seleniumdownloads\\",
  //"DriverLocation": "C:\\SeleniumDrivers",

  // 3. Change default functionality of Browser Base Framework. For example, if you set the ExtentReport_AddDateStampToFileName 
  // property to true, this will add a date stamp onto the end of the the Extent Report file name. Note that screenshots are 
  // printed on Extent Reports by obtaining them from the ScreenshotsOfFailedTests folder, so if you use this property 
  // to store old Extent Reports, you must not delete any screenshots in that folder if you want to view screenshots on 
  // these old Extent Reports
  "ExtentReport_AddDateStampToFileName": "false",


  // 4. Change default functionality of Browser Base Framework. For example, if you set the ManualDriverInstallationForFirefox 
  // property to true, this will bypass the automatic driver installation 
  // (See: https://code.premierinc.com/docs/display/PQA/Browser+Configurations#BrowserConfigurations-AutomaticBrowserConfiguration)
  // and allow you to download and install a driver version of your choice within C:\seleniumdrivers. The reason this is sometimes 
  // needed is because of the following issue in Edge: https://code.premierinc.com/docs/display/PQA/Edge#Edge-EdgeDriverDoesNotStartLocally
  // and Firefox: 
  "ManualDriverInstallationForFirefox": "false"
}
